"SPC Password" = "Συνθηματικό SPC";
"Authentication Key" = "Κλειδί ελέγχου ταυτότητας";
"Incorrect key" = "Λανθασμένο κλειδί";
"Incorrect SPC Password" = "Λανθασμένο συνθηματικό SPC";
"Enter 26 digit key" = "Εισάγετε 26ψήφιο κλειδί ελέγχου ταυτότητας.";
"Security" = "Ασφάλεια";
"Too many retries of SPC." = "Πάρα πολλές προσπάθειες SPC.";
"AKEY set successfully." = "Το AKEY ρυθμίστηκε με επιτυχία.";
"Failed to set AKEY." = "Απέτυχε η ρύθμιση AKEY.";
"Too many retries of AKEY." = "Πάρα πολλές προσπάθειες AKEY.";
"Password" = "Συνθηματικό";
"Key" = "Κλειδί";
"OK" = "ΟΚ";
"Cancel" = "Ακύρωση";